Masmiseim36/nxpSDK/boards/twrkv46f150m/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKV46F256xxx16
package_id: MKV46F256VLL16
mcu_data: ksdk2_0
processor_version: 4.0.0
board: TWR-KV46F150M
pin_labels:
- {pin_num: '34', pin_signal: PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/XBARIN4/EWM_IN/JTAG_TCLK/SWD_CLK, label: 'U6[3]/J18[4]/J501[29]/GPIOA0/TCK', identifier: JTAG_TCK}
- {pin_num: '35', pin_signal: PTA1/UART0_RX/FTM0_CH6/CMP0_OUT/FTM1_CH1/JTAG_TDI, label: 'J18[8]/J501[25]/GPIOA1/TDI', identifier: JTAG_TDI}
- {pin_num: '36', pin_signal: PTA2/UART0_TX/FTM0_CH7/CMP1_OUT/FTM1_CH0/JTAG_TDO/TRACE_SWO, label: 'J18[6]/J501[27]/GPIOA2/TDO', identifier: JTAG_TDO}
- {pin_num: '37', pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/XBARIN9/EWM_OUT/FlexPWM_A0/JTAG_TMS/SWD_DIO, label: 'U511[3]/J18[2]/J501[31]/GPIOA3/TMS', identifier: JTAG_TMS}
- {pin_num: '38', pin_signal: PTA4/LLWU_P3/FTM0_CH1/XBARIN10/FTM0_FLT3/FlexPWM_B0/NMI_b, label: 'J503[3]/J18[9]/GA4'}
- {pin_num: '39', pin_signal: PTA5/FTM0_CH2/CMP2_OUT/JTAG_TRST_b, label: 'J503[5]/GA5'}
- {pin_num: '42', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA, label: 'U503[1]/J16[1]/J500[B42]/J502[15]/GPIOA12/CAN0_TX'}
- {pin_num: '43', pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB, label: 'U503[4]/J16[3]/J500[B41]/J502[17]/GPIOA12/CAN0_RX'}
- {pin_num: '44', pin_signal: CMP3_IN0/PTA14/SPI0_PCS0/UART0_TX, label: 'J500[B46]/J502[16]/GPIOA14/SPI_CS0'}
- {pin_num: '45', pin_signal: CMP3_IN1/PTA15/SPI0_SCK/UART0_RX, label: 'J500[B48]/J502[20]/GPIOA15/SPI_SCK'}
- {pin_num: '46', pin_signal: CMP3_IN2/PTA16/SPI0_SOUT/UART0_CTS_b/UART0_COL_b, label: 'J500[B45]/J502[22]/GPIOA16/SPI_SOUT'}
- {pin_num: '47', pin_signal: ADCA_CH7e/PTA17/SPI0_SIN/UART0_RTS_b, label: 'J500[B44]/J502[18]/GPIOA17/SPI_SIN'}
- {pin_num: '50', pin_signal: EXTAL0/PTA18/XBARIN7/FTM0_FLT2/FTM_CLKIN0/XBAROUT8/FTM3_CH2, label: 'Y1[1]/J500[B24]/J502[10]/GPIOA18/EXTAL_J', identifier: EXTAL0}
- {pin_num: '51', pin_signal: XTAL0/PTA19/XBARIN8/FTM1_FLT0/FTM_CLKIN1/XBAROUT9/LPTMR0_ALT1, label: 'Y1[2]/J502[8]/GPIOA19/XTAL_J', identifier: XTAL0}
- {pin_num: '53', pin_signal: ADCB_CH2/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: 'J500[B28]/J501[22]/GPIOB0/ADCB_CH2'}
- {pin_num: '54', pin_signal: ADCB_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'J500[B27]/J501[33]/GPIOB1/ADCB_CH3'}
- {pin_num: '55', pin_signal: ADCA_CH6e/CMP2_IN2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, label: 'J503[21]/GB2'}
- {pin_num: '56', pin_signal: ADCB_CH7e/CMP3_IN5/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/FTM0_FLT0, label: 'J500[B35]/J501[2]/J2[4]/GB3/ADCB_CH7E/THM3JN'}
- {pin_num: '57', pin_signal: PTB9, label: 'J503[23]/GB9'}
- {pin_num: '58', pin_signal: ADCB_CH6a/PTB10/FTM0_FLT1, label: 'J2[2]/J500[B23]/J501[39]/GPIOB10/ADCB_CH6A/THM3JP'}
- {pin_num: '59', pin_signal: ADCB_CH7a/PTB11/FTM0_FLT2, label: 'J503[25]/GB11'}
- {pin_num: '62', pin_signal: PTB16/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XBARIN5, label: 'J500[B52]/J502[1]/GPIOB16/XBARIN5'}
- {pin_num: '63', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b, label: 'J503[12]/GB17'}
- {pin_num: '64', pin_signal: PTB18/CAN0_TX/FTM3_CH2, label: 'J503[14]/GB18'}
- {pin_num: '65', pin_signal: PTB19/CAN0_RX/FTM3_CH3, label: 'J503[16]/GB19'}
- {pin_num: '66', pin_signal: PTB20/FlexPWM_X0/CMP0_OUT, label: 'J500[C40]/J503[18]/GPIOB20/PWM_X0'}
- {pin_num: '67', pin_signal: PTB21/FlexPWM_X1/CMP1_OUT, label: 'J500[C39]/J503[20]/GPIOB21/PWM_X1'}
- {pin_num: '68', pin_signal: PTB22/FlexPWM_X2/CMP2_OUT, label: 'J500[C38]/J503[22]/GPIOB22/PWM_X2'}
- {pin_num: '69', pin_signal: PTB23/SPI0_PCS5/FlexPWM_X3/CMP3_OUT, label: 'J4[3]/J500[C37]/J502[9]/GPIOB23/PWM_X3/LED8', identifier: LED_ORANGE}
- {pin_num: '70', pin_signal: ADCB_CH6b/PTC0/SPI0_PCS4/PDB0_EXTRG/FTM0_FLT1/SPI0_PCS0, label: 'J503[27]/GC0'}
- {pin_num: '71', pin_signal: ADCB_CH7b/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FlexPWM_A3/XBARIN11, label: 'J500[B38]/J501[26]/GPIOC1/PWM_A3/LED6', identifier: LED_GREEN4}
- {pin_num: '72', pin_signal: ADCB_CH6c/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FlexPWM_B3/XBARIN6, label: 'J500[B37]/J501[28]/GPIOC2/PWM_B3/LED7', identifier: LED_YELLOW4}
- {pin_num: '73', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/FTM3_FLT0, label: 'J500[A64]/J502[12]/GPIOC3/CLKOUT', identifier: CLKOUT}
- {pin_num: '76', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, label: 'J503[31]/GC4'}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/XBARIN2/CMP0_OUT/FTM0_CH2, label: 'J502[3]/GPIOC5/XBARIN2'}
- {pin_num: '78', pin_signal: CMP2_IN4/CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/XBARIN3/UART0_RX/XBAROUT6/I2C0_SCL, label: 'J500[B61]/GC6'}
- {pin_num: '79', pin_signal: CMP3_IN4/CMP0_IN1/PTC7/SPI0_SIN/XBARIN4/UART0_TX/XBAROUT7/I2C0_SDA, label: 'J4[1]/J500[B62]/GC7/SW1', identifier: SW1}
- {pin_num: '80', pin_signal: ADCB_CH7c/CMP0_IN2/PTC8/FTM3_CH4, label: 'J500[A34]/J501[13]/GPIOC8/FTM3_CH4'}
- {pin_num: '81', pin_signal: ADCB_CH6d/CMP0_IN3/PTC9/FTM3_CH5, label: 'J500[B33]/J501[15]/GPIOC9/FTM3_CH5'}
- {pin_num: '82', pin_signal: ADCB_CH7d/PTC10/FTM3_CH6, label: 'J501[17]/GPIOC10/FTM3_CH6'}
- {pin_num: '83', pin_signal: ADCB_CH6e/PTC11/LLWU_P11/FTM3_CH7, label: 'J500[A33]/J501[19]/GPIOC11/FTM3_CH7'}
- {pin_num: '84', pin_signal: PTC12/FTM_CLKIN0/FTM3_FLT0, label: 'J503[24]/GC12'}
- {pin_num: '85', pin_signal: PTC13/FTM_CLKIN1, label: 'J503[26]/GC13'}
- {pin_num: '86', pin_signal: PTC14/I2C0_SCL, label: 'J500[A7]/J501[21]/GPIOC14/I2C0_SCL'}
- {pin_num: '87', pin_signal: PTC15/I2C0_SDA, label: 'J500[A8]/J501[23]/GPIOC15/I2C0_SDA'}
- {pin_num: '90', pin_signal: PTC16/CAN1_RX, label: 'J503[28]/GC16'}
- {pin_num: '91', pin_signal: PTC17/CAN1_TX, label: 'J503[30]/GC17'}
- {pin_num: '92', pin_signal: PTC18, label: 'J503[32]/GC18'}
- {pin_num: '93', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/FTM3_CH0/FTM0_CH0/FlexPWM_A0, label: 'J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0', identifier: LED_GREEEN1}
- {pin_num: '94', pin_signal: ADCA_CH7f/PTD1/SPI0_SCK/FTM3_CH1/FTM0_CH1/FlexPWM_B0, label: 'J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1', identifier: LED_YELLOW1}
- {pin_num: '95', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/FTM3_CH2/FTM0_CH2/FlexPWM_A1/I2C0_SCL, label: 'J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2', identifier: LED_GREEN2}
- {pin_num: '96', pin_signal: PTD3/SPI0_SIN/FTM3_CH3/FTM0_CH3/FlexPWM_B1/I2C0_SDA, label: 'J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3', identifier: LED_YELLOW2}
- {pin_num: '97', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FlexPWM_A2/EWM_IN/SPI0_PCS0, label: 'J500[B40]/J501[34]/GPIOD4/PWM_A2/LED4', identifier: LED_GREEN3}
- {pin_num: '98', pin_signal: ADCA_CH6g/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FlexPWM_B2/EWM_OUT_b/SPI0_SCK, label: 'J500[B39]/J501[36]/GPIOD5/PWM_B2/LED5',
  identifier: LED_YELLOW3}
- {pin_num: '99', pin_signal: ADCA_CH7g/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, label: 'J500[A41]/J506[2]/GPIOD6/RXD0'}
- {pin_num: '100', pin_signal: PTD7/UART0_TX/FTM0_CH7/FTM1_CH1/FTM0_FLT1/SPI0_SIN, label: 'J500[A42]/J505[2]/GPIOD7/TXD0'}
- {pin_num: '1', pin_signal: ADCB_CH6f/PTE0/UART1_TX/XBAROUT10/XBARIN11, label: 'J500[A44]/J501[5]/J505[4]/GPIOE0/TXD1', identifier: DEBUG_UART_TX}
- {pin_num: '2', pin_signal: ADCB_CH7f/PTE1/LLWU_P0/UART1_RX/XBAROUT11/XBARIN7, label: 'J500[A43]/J501[7]/J506[4]/GPIOE1/RXD1', identifier: DEBUG_UART_RX}
- {pin_num: '3', pin_signal: ADCB_CH6g/PTE2/LLWU_P1/UART1_CTS_b, label: 'J503[7]/GE2'}
- {pin_num: '4', pin_signal: ADCB_CH7g/PTE3/UART1_RTS_b, label: 'J503[9]/GE3'}
- {pin_num: '5', pin_signal: PTE4/LLWU_P2, label: 'J503[11]/GE4'}
- {pin_num: '6', pin_signal: PTE5/FTM3_CH0, label: 'J5[3]/J502[13]/GPIOE5/FTM3_CH0'}
- {pin_num: '7', pin_signal: PTE6/LLWU_P16/FTM3_CH1, label: 'J5[1]/J502[11]/GPIOE6/FTM3_CH1/SW2', identifier: SW2}
- {pin_num: '10', pin_signal: ADCA_CH0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: 'J500[A27]/J501[10]/GPIOE16/ADCA_CH0'}
- {pin_num: '11', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'J500[A28]/J501[12]/GPIOE17/ADCA_CH1'}
- {pin_num: '12', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, label: 'J500[B30]/J501[18]/ADCB_CH0'}
- {pin_num: '13', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT, label: 'J500[B29]/J501[20]/ADCB_CH1'}
- {pin_num: '16', pin_signal: ADCA_CH6b/PTE20/FTM1_CH0/UART0_TX, label: 'J500[C33]/J502[5]/J503[2]/GE20/FTM1_CH0'}
- {pin_num: '17', pin_signal: ADCA_CH7b/PTE21/FTM1_CH1/UART0_RX, label: 'J500[C34]/J502[7]/J503[4]/GE21/FTM1_CH1'}
- {pin_num: '31', pin_signal: ADCB_CH4/PTE24/CAN1_TX/FTM0_CH0/XBARIN2/I2C0_SCL/EWM_OUT_b/XBAROUT4, label: 'J1[2]/J500[B21]/J501[35]/GPIOE24/ADCB_CH4/THM2JP'}
- {pin_num: '32', pin_signal: ADCB_CH5/PTE25/LLWU_P21/CAN1_RX/FTM0_CH1/XBARIN3/I2C0_SDA/EWM_IN/XBAROUT5, label: 'J1[4]/J500[B22]/J501[37]/GPIOE25/ADCB_CH5/THM2JN'}
- {pin_num: '33', pin_signal: PTE26, label: 'J503[1]/GE26'}
- {pin_num: '26', pin_signal: ADCA_CH4/CMP1_IN5/CMP0_IN5/PTE29/FTM0_CH2/FTM_CLKIN0, label: 'J23[2]/J500[A9]/J501[38]/GPIOE29/ADCA_CH4/THM0JP'}
- {pin_num: '27', pin_signal: DAC0_OUT/CMP1_IN3/ADCA_CH5/PTE30/FTM0_CH3/FTM_CLKIN1, label: 'J23[4]/J500[A10]/J500[A32]/J501[40]/GPIOE30/ADCA_CH5/THM0JN'}
- {pin_num: '20', pin_signal: ADCA_CH6c, label: 'J19[2]/J500[A11]/ADCA_CH6C/THM1JP'}
- {pin_num: '21', pin_signal: ADCA_CH7c, label: 'J19[4]/J500[C27]/ADCA_CH7C/THM1JN'}
- {pin_num: '14', pin_signal: ADCA_CH6a, label: 'J500[C28]/J502[2]/ADCA_CH6A'}
- {pin_num: '15', pin_signal: ADCA_CH7a, label: 'J502[4]/ADCA_CH7A'}
- {pin_num: '24', pin_signal: VREFL, label: 'J503[19]/VREFL_DEVICE'}
- {pin_num: '60', pin_signal: VSS60, label: GND}
- {pin_num: '74', pin_signal: VSS74, label: GND}
- {pin_num: '23', pin_signal: VREFH, label: 'J503[17]/VREFH_DEVICE'}
- {pin_num: '49', pin_signal: VSS49, label: GND}
- {pin_num: '41', pin_signal: VSS41, label: GND}
- {pin_num: '25', pin_signal: VSSA, label: GND}
- {pin_num: '9', pin_signal: VSS9, label: GND}
- {pin_num: '22', pin_signal: VDDA, label: VDDA}
- {pin_num: '8', pin_signal: VDD8, label: MCU_VDD}
- {pin_num: '30', pin_signal: VDD30, label: MCU_VDD}
- {pin_num: '40', pin_signal: VDD40, label: MCU_VDD}
- {pin_num: '48', pin_signal: VDD48, label: MCU_VDD}
- {pin_num: '61', pin_signal: VDD61, label: MCU_VDD}
- {pin_num: '75', pin_signal: VDD75, label: MCU_VDD}
- {pin_num: '89', pin_signal: VDD89, label: MCU_VDD}
- {pin_num: '88', pin_signal: VSS88, label: GND}
- {pin_num: '52', pin_signal: RESET_b, label: 'U3[3]/J18[10]/J20[2]/J500[A62]/J501[4]/CPU_RESET_B'}
- {pin_num: '18', pin_signal: ADCA_CH2, label: 'J500[A29]/J501[14]/ADCA_CH2'}
- {pin_num: '19', pin_signal: ADCA_CH3, label: 'J500[A30]/J501[6]'}
- {pin_num: '28', pin_signal: ADCA_CH6d/CMP0_IN4/CMP2_IN3, label: 'J503[10]/ADCA_CH6D'}
- {pin_num: '29', pin_signal: VSS29, label: GND}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

